<a href="https://colab.research.google.com/github/JuanPZ2000/Taller2IA/blob/main/BaseDatosOro_JP.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## ORO!!! Forecasting

In [1]:
## Importando las librerías
import pandas as pd
import numpy as np

In [3]:
dataframeGold = pd.read_csv('gold_price_data.csv')
print(dataframeGold.columns)
dataframeGold.describe()

Index(['Date', 'Value'], dtype='object')

              Value
count  10787.000000
mean     653.596634
std      434.030848
min       35.100000
25%      349.200000
50%      409.350000
75%     1061.625000
max     1895.000000

In [4]:
print(dataframeGold.dtypes)
dataframeGold.head(10)

Date      object
Value    float64
dtype: object

         Date  Value
0  1970-01-01   35.2
1  1970-04-01   35.1
2  1970-07-01   35.4
3  1970-10-01   36.2
4  1971-01-01   37.4
5  1971-04-01   38.9
6  1971-07-01   40.1
7  1971-10-01   42.0
8  1972-01-03   43.5
9  1972-04-03   48.3

In [5]:
etiqueta = np.array(dataframeGold['Value'])[2:]
car_m1 = np.array(dataframeGold['Value'])[1:-1]
car_m2 = np.array(dataframeGold['Value'])[:-2]
print(len(etiqueta))
print(len(car_m1))
print(len(car_m2))

10785
10785
10785

In [6]:
## Agrupando los datos en un único Dataframe y exportándolo a un archivo CSV
dataset = pd.DataFrame({'Carac menos 2':car_m2, 'Carac menos 1':car_m1, 'Etiqueta':etiqueta})
dataset.to_csv('goldPriceArranged.csv')

In [7]:
## Pasando los datos a una matriz de tipo numpy
matrizDatos = dataset.to_numpy()
print(matrizDatos.shape)

(10785, 3)

In [8]:
def funcCosto(a, b):
  J = (a-b)**2
  return np.sum(J)/(2*len(J))

In [9]:
# Hipotesis
J,T0,T1,min = 0,0,0,100
for T0i in np.arange(-2,2,1/100):
  for T1j in np.arange(-2,2,1/100):
    #Encontrar hipotesis
    h = T0i*car_m1 + T1j*car_m2
    #Funcion de costo
    J=funcCosto(h,etiqueta)
    if J < min:
      min = J
      T0 = T0i
      T1 = T1j

print("Los mejores parámetros son:",T0,T1,"donde la función de costo retornó: ",min)

Los mejores parámetros son: 0.9900000000000029 0.010000000000001563 donde la función de costo retornó:  40.803401532663564